plate/example/0/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 101325;

boundaryField
{
    maxY
    {
        type            prghTotalPressure;
        p               $internalField;
        value           $internalField;
        p0              $internalField;
        U               U.gas;
    }
    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    fluid_to_solid
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}


// ************************************************************************* //
