plate/example/0/fluid/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
27950
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
4445
(
1
1
1
1
1
1
1
1
...
)
;
    }
    maxY
    {
        type            calculated;
        value           uniform 0;
    }
    fluid_to_solid
    {
        type            calculated;
        value           uniform 1;
    }
}


// ************************************************************************* //
